Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: །འཇིག་རྟེན་ཀུན་ལ་མི་གནས་སྤྱོད་ཡུལ་དང་། །ནམ་མཁའི་སྤྱོད་ཡུལ་བཟང་པོར་ཁྱོད་སྤྱོད་འགྱུར།
en: “You will have a conduct that is not located in any world. You will practice a conduct in the excellent field of activity of space.

source: །ཁྱོད་ཀྱི་སྤྱོད་ཡུལ་རབ་ཏུ་ཞི་བར་འགྱུར།
en: Your field of activity will be one of peace.

source: །ཁྱོད་ཀྱི་མངོན་ཤེས་སྤྱོད་ཡུལ་དེ་འདྲ་འོ།
en: Such will be the field of activity of your higher cognition.

source: །མིག་འཕྲུལ་འདྲ་བའི་བྱེ་བྲག་གཞི་མཁས་ཁྱོད།
en: “You will be wise in the different aspects of the net of illusions. Before long you will pervade completely,

source: །ཞིང་གི་དྲ་བའི་བྱེ་བྲག་ཇི་སྙེད་གཞི། །སེར་བུ་མཁའ་ལ་ཆགས་པ་མེད་པ་ལྟར།
en: Like hail falling without impediment from the sky, As many of the different surfaces of the net of realms as there are.

source: །རིང་པོར་མི་ཐོགས་རྒྱས་པར་འགེངས་པར་འགྱུར། །ཆོས་དབྱིངས་འབྱམ་ཀླས་ཁོང་དུ་ཆུད་པར་འགྱུར།
en: “You will comprehend the vast extent of the realm of phenomena,

source: །འབྱམ་ཀླས་འཇིག་རྟེན་ཁམས་སུ་འགྲོ་བར་འགྱུར།
en: You will go to the vast extent of world realms,

source: །དུས་གསུམ་གཤེགས་པའི་སངས་རྒྱས་འབྱམ་ཀླས་ཀུན།
en: And you will see the vast extent of the buddhas in the three times;

source: །མཐོང་བར་འགྱུར་གྱིས་ནོར་བཟངས་དགའ་བར་གྱིས།
en: Therefore, Sudhana, be happy!

source: །ཁྱོད་ཀྱིས་དེ་འདྲའི་རྣམ་ཐར་དེ་ལྟ་བུ།
en: “You have seen these kinds of liberation,

source: །མཐོང་ལ་མཐོང་ཞིང་ད་དུང་མཐོང་བར་འགྱུར།
en: Are seeing them, and will still see them.

source: །དེ་བས་མཁས་པ་སྐྱོ་བར་མ་བྱེད་ཅིག །དགའ་ཡངས་ཟང་ཟིང་མེད་པ་ཉམས་སུ་ལོང་།
en: Therefore, Sudhana, do not be saddened But be happy and free from worries.

source: །ནོར་བཟངས་ཁྱོད་ནི་ཡོན་ཏན་སྣོད་བཟང་སྟེ།
en: “Sudhana. you are an excellent vessel for good qualities.

source: །ཁྱོད་ནི་རྒྱལ་བ་རྣམས་ཀྱི་གདམས་ངག་མཐུན།
en: You accord with the instructions of the jinas.

source: །ཁྱོད་ཀྱིས་ཚུལ་འདི་ཡོངས་སུ་གཟུང་བར་ནུས།
en: You have the ability to keep to this way.

source: །དེ་བས་རྣམ་པར་འཕྲུལ་པ་འདི་དག་མཐོང་།
en: That is why you see these miraculous manifestations.

source: །སངས་རྒྱས་སྲས་པོ་གནས་མེད་སྤྱོད་ཡུལ་ཅན།
en: “Sons of the buddhas who have the conduct without location

source: །གང་རྣམས་མཐོང་བར་བསྐལ་པ་ཁྲག་ཁྲིག་དུ།
en: Are indescribable and very difficult to ever see,

source: །ཤིན་ཏུ་དགའ་ན་ལེགས་བརྗོད་མི་སྨོས་པ།
en: Even during a hundred billion kalpas, but you

source: །དེ་དག་སྤྱོད་ལེགས་སྤྱོད་ཚེ་ཁྱོད་ཀྱིས་མཐོང་།
en: Have seen their conduct at the time of their excellent conduct.

source: །དེ་ལྟར་འཇམ་དཔལ་མངོན་དུ་མཐོང་གྱུར་ཏེ།
en: “In that way, you have directly perceived Mañjuśrī,

source: །དེ་འདྲའི་ཡོན་ཏན་སྣོད་དུ་གྱུར་བྱས་པ།
en: And having become such a vessel for good qualities,

source: །ཁྱོད་ཀྱིས་ཐོབ་པ་རྒྱ་ཆ་བསམ་མི་ཁྱབ།
en: Your attainment is vast and inconceivable.

source: །མི་ཡི་སྲིད་པར་ཁྱོད་ནི་ལེགས་པར་འོངས།
en: You who have become a human are welcome! “You have turned away from all paths to the lower existences.

source: །ངན་སོང་ལམ་རྣམས་ཐམས་ཅད་རྣམ་པར་ཟློག །མི་ཁོམ་ངན་འགྲོ་ཐམས་ཅད་རྣམ་པར་སྦྱངས།
en: You have been purified of all inopportune, unfortunate existences.

source: །སྡུག་བསྔལ་ཆོས་རྣམས་ཁྱོད་ཀྱིས་ཐམས་ཅད་བོར།
en: You have cast away all the qualities of suffering,

source: །མི་དགའ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བར་གྱིས།
en: So cast aside all unhappiness.

source: །བྱིས་པའི་ས་ནི་ཁྱོད་ཀྱིས་རྣམ་པར་ཟློག།
en: “You have turned away from the level of foolish beings.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ས་ལ་གནས།
en: You are established on the level of bodhisattva qualities.

source: །ཡེ་ཤེས་ས་ཡི་དམ་པ་ཡོངས་བསྐང་ཞིང་།
en: You have filled the supreme level of wisdom,

source: །སངས་རྒྱས་སར་བ་རིང་པོར་མི་ཐོགས་ཐོབ།
en: And you will soon attain the level of a buddha. “You should be happy, for you have attained

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་སྟེང་།
en: All the oceans of bodhisattva conduct,

source: །སངས་རྒྱས་ཡེ་ཤེས་ནམ་མཁའི་མཛོད་དང་མཚུངས།
en: The wisdom of the buddhas, which is like the treasure of space,

source: །དེ་ཡི་ཚད་ཀྱི་སྨོན་ལམ་གང་ཆེན་མཚོ།
en: And the corresponding extent of the ocean of prayers.

source: །དེ་ལྟར་དབང་པོ་ཡོངས་སུ་མི་སྐྱོ་ལ།
en: “Those who thus have unwearying powers,

source: །བསམ་པ་བརྟན་ཞིང་སྦྱོར་བ་ངེས་པ་རྣམས།
en: Strong aspiration, and definite practice

source: །གང་དག་འདི་འདྲའི་བཤེས་གཉེན་བསྟེན་བྱེད་པ།
en: And rely on these kinds of kalyāṇamitras

source: །དེ་དག་རིང་བོར་མི་ཐོགས་མགོན་པོར་འགྱུར། །ཁྱོད་ཀྱི་བྱང་ཆུབ་སྤྱོད་པ་སྣ་ཚོགས་ཀྱིས།
en: Will become leaders before long.

source: །སེམས་ཅན་མང་པོ་དུལ་བར་གྱུར་མཐོང་ཞིང་།
en: “You have seen many beings being guided

source: །ཆོས་ཀུན་སྒོ་ཡི་བྱང་ཆུབ་སྤྱོད་པ་ལ།
en: By a variety of bodhisattva conducts.

source: །ནམ་ཡང་ཡིད་གཉིས་བྱེད་པར་མ་གྱུར་ཅིག །དེ་ལྟར་ཕུན་སུམ་ཚོགས་པ་འདི་འདྲ་འདི།
en: You should not develop any doubts concerning Bodhisattva activity that is the gateway to all Dharmas. “Your perfection of merit is inconceivable. You have perfect benefit, Dharma qualities, and faith.

source: །སངས་རྒྱས་སྲས་པོ་དེ་རིང་འདིར་མཐོང་བ།
en: Because of that, today, here, son of the buddhas,

source: །དོན་ཆོས་ཡོན་ཏན་དང་བ་ཕུན་སུམ་ཚོགས།
en: You are seeing this kind of perfection.

source: །ཁྱོད་ཀྱི་བསོད་ནམས་ཕུན་ལྡན་བསམ་མི་ཁྱབ།
en: “Look at the great attainment of yours

source: །དེ་ལྟར་རྒྱལ་སྲས་རྣམས་ཀྱི་རྒྱུན་འབྲེལ་བར།
en: In seeing this continuous succession of jinaputras,

source: །རང་རང་སོ་སོའི་སྨོན་ལམ་བསྟན་བྱས་ཏེ།
en: Each one revealing to you their individual prayers,

source: །ཁྱོད་ཀྱི་དེ་དག་མ་ལུས་མཐུན་རྟོགས་པ། །ཁྱོད་མཐོང་ཐོབ་པ་ཆེན་པོ་ཅི་འདྲ་ལྟོས། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྣོད་གྱུར་པ།
en: And you comprehend them all accordingly.

source: །དེ་འདྲའི་སྲིད་པ་བརྒྱར་ཡང་དཀོན་པས་ན།
en: “Even in a hundred existences it is difficult To find such a vessel for bodhisattva conduct as you.

source: །དེ་ཕྱིར་རྒྱལ་སྲས་དེ་དག་རྒྱུན་འབྲེལ་བར།
en: Therefore, the jinaputras in continuous succession

source: །ཁྱོད་ལ་རྣམ་ཐར་ཚུལ་རྣམས་ཡོངས་སུ་སྟོན།
en: Teach you the ways of the liberations.

source: །བསྐལ་བ་ཁྲག་ཁྲིག་བྱེ་བར་འགྲོ་བ་གང་།
en: “Those beings who during a quintillion kalpas

source: །བདེ་གཤེགས་སྲས་དང་ལྷན་ཅིག་འགྲོགས་གྱུར་པ།
en: Have been in the company of sons of the sugatas

source: །དེ་དག་དེ་རྣམས་སྤྱོད་ཡུལ་མི་ཤེས་ཏེ།
en: Without knowing their field of activity

source: །དེ་དག་ཡོན་ཏན་སྣོད་དུ་བདག་མ་བྱས།
en: Cannot themselves be vessels for the good qualities.

source: །ཁྱོད་ཀྱིས་འདི་འདྲའི་ཚུལ་འདི་ཐོས་པར་འགྱུར། །བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་འཕྲུལ་བ།
en: “You have heard these kinds of ways,

source: །འགྲོ་བ་ཀུན་ན་དཀོན་པ་ཁྱོད་ཀྱིས་མཐོང་།
en: And you have seen the miraculous manifestations Of great bodhisattvas, which are rare in the world;

source: །དེ་ལྟར་ནོར་བཟངས་དགའ་བའི་ཡིད་དུ་གྱིས།
en: Therefore, Sudhana, have a happy mind!

source: །ཁྱོད་ལ་སངས་རྒྱས་ཐམས་ཅད་དགོངས་པ་མཛད།
en: “All of the buddhas pay heed to you.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཁྱོད་གཟུང་ཕྱིར་ཡང་གནས།
en: All the bodhisattvas remain caring for you,

source: །ཁྱོད་ཀྱང་དེ་དག་རྗེས་སུ་བསྟན་ལ་གནས།
en: And you are established in their teaching.

source: །ལེགས་སོ་ནོར་བཟངས་ཁྱོད་ཀྱི་འཚོ་བ་དགེ །བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཀྱི་ཆོས་ལ་གནས།
en: Well done, Sudhana, you have a good life! “You dwell within the family of the bodhisattvas.

source: །ཁྱོད་ནི་རྒྱལ་སྲས་ཡོན་ཏན་རྣམས་ལ་སློབ།
en: You train in the qualities of the jinaputras.

source: །བདེ་བར་གཤེགས་རིགས་རྣམ་པར་འཕེལ་བྱེད་འགྱུར།
en: You will increase the lineage of the sugatas.

source: །ནོར་བཟངས་དགའ་བ་རྒྱ་ཆེན་ཉམས་སུ་ལོང་།
en: Sudhana, you should experience the highest joy!

source: །སངས་རྒྱས་མཉམ་མེད་ཐམས་ཅད་ཁྱོད་ཀྱི་ཕ།
en: “All the unequaled buddhas are your fathers.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཁྱོད་དང་སྤུན།
en: All the bodhisattvas are your brothers.

source: །བྱང་ཆུབ་ཡན་ལག་ཐམས་ཅད་ཁྱོད་ཀྱི་གཉེན།
en: All the aspects of enlightenment are your relatives.

source: །ཁྱོད་ནི་བདེ་གཤེགས་ཐུགས་ལས་སྐྱེས་པའི་སྲས།
en: You are a son born from the heart of the sugatas.

source: །ཆོས་ཀྱི་རྒྱལ་པོ་རིག་པའི་རྒྱུད་འཛིན་པ།
en: “You are a holder of the family lineage of the king of Dharma.

source: །བྱང་ཆུབ་སེམས་དཔའི་རིགས་རྒྱུད་འཕེལ་བར་བྱེད།
en: You increase the family lineage of the bodhisattvas.

source: །རིང་པོར་མི་ཐོགས་ཆོས་རྒྱལ་ཐོབ་འགྱུར་གྱིས།
en: Before long you will become a king of the Dharma.

source: །ནོར་བཟངས་དབང་པོ་ཚིམ་ཞིང་དགའ་བར་གྱིས། །སངས་རྒྱས་ཀུན་གྱི་དབང་བསྐུར་དམ་པ་ཡང་།
en: Sudhana, be happy, with satisfied senses.

source: །རིང་པོར་མི་ཐོགས་རྨད་བྱུང་ཐོབ་པར་འགྱུར།
en: “Before long you will attain the wonderful, Supreme consecration from all the buddhas.

source: །རྒྱལ་བའི་སྲས་དང་མཚུངས་ཤིང་མཉམ་པར་འགྱུར།
en: You will become the same as and equal to the bodhisattvas,

source: །ཁྱོད་ཀྱི་སྤྱོད་པའི་ཚུལ་མཐུན་དེ་འདྲའོ།
en: And your conduct will also be the same in that way.

source: །མི་གང་ཅི་འདྲའི་ས་བོན་འདེབས་བྱེད་པ།
en: “Whatever kinds of seeds are planted by humans,

source: །དེ་ནི་དེ་འདྲའི་འབྲས་བུ་ཐོབ་པར་འགྱུར།
en: They will gain the corresponding results.

source: །དགའ་བ་རྒྱ་ཆེན་བསམ་ཡས་ཉམས་སུ་ལོང་།
en: You should experience an inconceivable, vast joy,

source: །ངས་ནི་དེ་རིང་ཁྱོད་ཀྱི་དབུགས་ཀྱང་དབྱུང་།
en: For today I am giving you my reassurance.

source: །ཚེ་གཅིག་ཁྱོད་ཀྱིས་གང་རྣམས་ཐོབ་གྱུར་པ།
en: “That which you have attained in one lifetime Is a perfection that has not been obtained

source: །བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་བསམ་ཡས་པ།
en: By countless billions of bodhisattvas

source: །བསྐལ་བ་ཁྲག་ཁྲིག་བྱང་ཆུབ་སྤྱད་སྤྱོད་པ།
en: Practicing bodhisattva conduct in billions of kalpas.

source: །དེ་དག་གིས་ཀྱང་ཕུན་སུམ་འདི་མ་རྙེད།
en: “Whoever delights in this conduct

source: །འདི་རྣམས་ཐམས་ཅད་མོས་པའི་འབྲས་བུ་སྟེ།
en: In all these results that are aspired to,

source: །བརྩོན་འགྲུས་བསམ་པ་དག་ནི་དེ་བཞིན་ནོ། །གང་ཞིག་སྤྱོད་པ་འདི་འདྲ་དཀའ་བ་ཡང་།
en: And similarly in its diligence and motivation,

source: །ནོར་བཟངས་སྤྱོད་པ་གང་ཡིན་དེ་ལ་སྤྱོད།
en: Should practice Sudhana’s conduct.

source: །སྤྱོད་པ་ཐམས་ཅད་སྨོན་ལམ་བྱུང་བ་ཡིན།
en: “All conduct originates from prayer.

source: །ཆོས་རྣམས་ཐམས་ཅད་མོས་ལས་ཡོངས་སུ་བྱུང་།
en: All Dharma originates from aspiration.

source: །ནོར་བཟངས་དེ་ལྟར་ཁྱོད་ཀྱིས་ཡོངས་སུ་བསྒྲུབས།
en: Sudhana, this has been accomplished by you.

source: །རྟག་ཏུ་ཁྱད་པར་སྤྱོད་པ་བཙལ་བར་གྱིས།
en: Always pursue this supreme conduct!

source: །ཀླུ་ཡི་བསམ་པ་ཇི་སྙེད་བྱུང་གྱུར་པ།
en: “To the extent that the nāgas have the intention,

source: །དེ་སྙེད་ཆར་པ་ཡོངས་སུ་འབབ་པར་འགྱུར།
en: To that extent there will come rainfall.

source: །སྨོན་ལམ་ཡེ་ཤེས་སྤྱོད་ཡུལ་ཇི་སྙེད་པ།
en: To the extent that there is the field of activity of the wisdom of prayers,

source: །དེ་སྙེད་བྱང་ཆུབ་སྤྱོད་པས་རྒྱས་པར་འགྱུར།
en: To that extent spreads the conduct of a bodhisattva.

source: །ནོར་བཟངས་བཟང་པོའི་སྤྱོད་ཅེས་བྱ་བ་འདི།
en: “Sudhana, this conduct that is called good,

source: །ཚུལ་ནི་ཁྱོད་ལ་བསྟན་པ་འདི་ཡིན་གྱིས།
en: This is the way that has been taught to you.

source: །དེ་ཤེས་གྱིས་ལ་དགེ་བཤེས་རང་བཞིན་གྱིས།
en: Knowing it, you will naturally be serving The kalyāṇamitras;

source: །བསྙེན་བཀུར་བྱེད་ཚེ་འཇུག་པར་མ་བྱེད་ཅིག །ལུས་རྣམས་བྱེ་བ་སྔན་ཅད་ཁྱོད་ཀྱིས་ཀྱང་།
en: at that time, have no fear. “Contemplate how in the past you have wasted

source: །འདོད་པའི་དོན་དུ་དོན་མེད་ཟད་བྱས་སོམས།
en: Millions of lives meaninglessly for the sake of desires.

source: །ད་ནི་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་གྱུར་ན།
en: Now, in seeking for enlightenment,

source: །བརྟུལ་ཤུགས་བཟང་པོ་བརྟུལ་བས་ཞིག་གོ་འདང་། །ཁྱོད་ཀྱིས་བསྐལ་པ་བྱེ་བ་འདས་བྱས་ཏེ།
en: Proceed perfectly disciplined by disciplined conduct. “While ten million kalpas passed by,

source: །འདུས་བྱས་སྡུག་བསྔལ་ཐམས་ཅད་ཉམས་སུ་མྱོང་།
en: You experienced all composite suffering.

source: །གང་གཱའི་བྱེ་སྙེད་སངས་རྒྱས་མཉེས་མ་བྱས།
en: You did not honor buddhas as numerous as the Ganges sands

source: །འདི་འདྲའི་ཚུལ་ཡང་ཐོས་པར་མ་གྱུར་ཏོ།
en: Or hear from them the teaching on this way.

source: །དེ་ལས་ད་ནི་ཁོམ་པར་མིར་ཡང་སྐྱེས།
en: “Now this time you have been born into an opportune human existence,

source: །སངས་རྒྱས་འབྱུང་མཐོང་དགེ་བཤེས་འདི་འདྲ་སྟེ།
en: Have seen the appearance of a buddha, and have heard

source: །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པའང་ཐོས་པར་འགྱུར།
en: This supreme bodhisattva conduct from these kinds of kalyāṇamitras,

source: །རྣམ་དག་སེམས་སུ་ད་གོ་ཅིར་མི་འགྱུར།
en: So why should your mind not be pure?

source: །བདེ་བར་གཤེགས་པ་ཡང་དུ་འབྱུང་བར་འགྱུར།
en: “The sugatas can appear repeatedly

source: །དགེ་བཤེས་དེ་བཞིན་ཆོས་མཉན་ཐོས་པར་འགྱུར།
en: And the Dharma heard from the kalyāṇamitras,

source: །གལ་ཏེ་བསམ་པ་ཡོངས་སུ་མ་སྦྱངས་ན།
en: But if your aspiration has not been purified,

source: །ཚུལ་འདི་ཕྱིན་ཆད་ཐོས་པར་དཀའ་བ་ཡིན།
en: It will be difficult to hear this way.

source: །དེ་བས་དད་དང་མོས་དང་བསམ་པ་རྣམས།
en: “Therefore, develop faith, aspiration, and motivation,

source: །ཡོངས་སུ་བསྐྱེད་ལ་བླ་མ་ཕུད་དུད་གྱིས།
en: And with veneration for the gurus

source: །ཐེ་ཙོམ་ལྟ་བ་ཡོངས་སུ་སྐྱོ་སྤངས་ལ།
en: Be weary of and reject views of doubt,

source: །ཡང་དང་ཡང་དུ་འདི་འདྲ་ཚུལ་ཉོན་ཅིག །གང་གིས་སྤྱོད་ལ་འཇུག་པ་འདི་འདྲ་འདི།
en: And listen again and again to this way. “Those who have heard this kind of entry into conduct

source: །ཐོས་ནས་དེ་འདྲའི་སྨོན་ལམ་མངོན་བསྒྲུབས་པ།
en: And have accomplished that kind of prayer

source: །དེ་དག་ཐོབ་པ་དམ་པ་བསམ་མི་ཁྱབ།
en: Will have an inconceivable, perfect attainment

source: །དེ་དག་མི་ཡི་སྲིད་པར་ལེགས་པར་འོངས།
en: And will have an excellent human existence.

source: །གང་གིས་དེ་འདྲའི་མོས་བ་སྦྱངས་པ་ནི།
en: “For the ones who purify that kind of aspiration,

source: །དེ་ལ་བདེ་གཤེགས་ཐམས་ཅད་མི་དཀོན་ནོ།
en: The sight of all the sugatas will not be rare.

source: །དེ་ནི་རྒྱལ་བ་རྣམས་ཀྱི་སྲས་དང་སྤུན།
en: All jinaputras will be their kin, and henceforward

source: །དེ་ལ་ཕྱིན་ཆད་བྱང་ཆུབ་ཐེ་ཙོམ་མེད།
en: He will have no doubts about enlightenment.

source: །གང་ཞིག་འདི་འདྲའི་ཚུལ་འདིར་ཞུགས་གྱུར་པ།
en: “Those who enter this kind of way

source: །དེས་ནི་ལོག་པར་ལྟུང་བ་ཐམས་ཅད་སྤངས།
en: Will forsake all downfalls through error,

source: །དེས་ནི་སྡུག་བསྔལ་ཆོས་རྣམས་ཐམས་ཅད་བསྩལ།
en: Will eliminate all the phenomena of suffering,

source: །དེས་ནི་ཡོན་ཏན་ཐམས་ཅད་བསྡུ་བ་བྱས།
en: And will accumulate all good qualities.

source: །ལུས་ནི་བོར་ནས་རིང་པོར་མི་ཐོགས་སུ།
en: “When the body is abandoned, one will soon

source: །ཡོངས་སུ་དག་པའི་སངས་རྒྱས་ཞིང་དུ་འགྲོ།
en: Go to a completely pure buddha realm;

source: །བྱང་ཆུབ་སེམས་དཔའི་གནས་སུ་འཇུག་པར་འགྱུར།
en: One will enter the dwellings of the bodhisattvas

source: །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར།
en: And will see the tathāgatas of the ten directions.

source: །ནོར་བཟངས་ཁྱོད་ཀྱི་སྔོན་གྱི་རྒྱུ་སྡུག་པས།
en: “Sudhana, through your multitude of causes in the past,

source: །ད་ལྟར་བྱུང་ལ་མོས་པ་ངེས་པ་ཡིས།
en: Through your definite aspiration in the present,

source: །ཁྱད་པར་དོན་གཉེར་དགེ་བཤེས་བསྟེན་བྱས་པས།
en: And through your relying on kalyāṇamitras for a special purpose,

source: །ཆུ་ལས་ཨུཏ་པལ་བཞིན་དེ་ཕྱིར་འཕེལ།
en: You will grow like a blue lotus on the water. “You who have the aspiration to revere all kalyāṇamitras,

source: །དགེ་བཤེས་ཐམས་ཅད་ཕུ་དུད་བསམ་པ་དང་། །སངས་རྒྱས་ཐམས་ཅད་དགྱེས་བྱའི་བསམ་པ་དང་། །ཆོས་ཀུན་ཡོངས་སུ་དྲི་བའི་བསམ་པ་ཅན།
en: You who have the aspiration to please all buddhas, You who have the aspiration to inquire about all Dharmas,

source: །བརྟུལ་ཞུགས་བཟང་པོ་ལྡན་པ་དལ་གྱིས་ལོངས།
en: You who have excellent discipline, stand up easefully.

source: །ཆོས་ཀྱི་ནན་ཏན་ཀུན་ལ་རབ་གནས་པ།
en: “Stand, you who are established in all practices of the Dharma,

source: །ལམ་རྣམས་རྗེས་སུ་ཀུན་ཚོལ་རབ་གནས་པ།
en: You who are established in following all paths,

source: །སངས་རྒྱས་སྲས་ཀྱི་སྨོན་ལམ་རབ་གནས་པ།
en: You who are established in the prayers of the sons of buddhas,

source: །ཡོན་ཏན་ཆོས་རྣམས་ཀུན་གྱི་སྣོད་ཁྱོད་ལོངས།
en: You who are a vessel for all good qualities and the Dharma.

source: །མོས་པ་ཕུན་སུམ་ཚོགས་པ་ཅི་འདྲ་བས།
en: “Just as you have developed a perfect aspiration

source: །ཁྱོད་ཀྱིས་ང་ལ་ཕྱག་འདི་བྱས་པ་ནི། །སངས་རྒྱས་ཐམས་ཅད་འཁོར་དུ་མངོན་སུམ་དུ།
en: And you have paid homage to me,

source: །རིང་པོར་མི་ཐོགས་ཡོངས་སུ་འབྱུང་བར་འགྱུར།
en: Before long you will come to be Directly before the assemblies of all buddhas.

source: །སྐྱོ་བའི་ཡིད་མེད་ནོར་བཟངས་ལེགས་པ་ཡིན།
en: “Well done, Sudhana, you who have an untiring mind,

source: །སངས་རྒྱས་ཀུན་གྱི་སྨོན་ལམ་སེམས་ལྡན་པ།
en: Who have the motivation of the prayers of all the buddhas;

source: །བརྟུལ་ཞུགས་བརྟན་ཁྱོད་རིང་པོར་མི་ཐོགས་པར།
en: You who have firm discipline, you will before long

source: །སངས་རྒྱས་ཀུན་གྱི་ཡོན་ཏན་མཐར་ཕྱིན་འགྱུར།
en: Perfectly accomplish the qualities of all buddhas. “Sudhana, go into the presence of Mañjuśrī,

source: །ཡེ་ཤེས་སྤྱོད་ཡུལ་རྣམ་པར་མཐར་ཕྱིན་པའི། །འཇམ་དཔལ་གན་དུ་ནོར་བཟངས་ཁྱོད་སོང་སྟེ།
en: Who has fully attained the field of activity of wisdom,

source: །བཟང་པོ་སྤྱོད་པ་དམ་པ་མཆོག་དྲིས་ཤིག །དེ་ཚུལ་ཁྱོད་འཇུག་དེ་ནས་བྱེད་པར་འགྱུར།
en: And ask him about the supreme, excellent good conduct, And then you will enter that way and practice it.”

source: །དེ་ལྟར་བྱམས་པ་ཆགས་མེད་སྤྱོད་ཡུལ་གྱིས།
en: In that way, Maitreya, who has an unimpeded field of activity,

source: །ནོར་བཟངས་ཡང་དག་ལེགས་པས་འཕགས་མཐོང་ནས།
en: Saw Sudhana, who was superior through his excellent qualities.

source: །འཁོར་རྣམས་ཀུན་ལ་མངོན་པར་བསྟན་བྱས་ཏེ།
en: He then showed him to his entire assembly of followers

source: །དེ་ཡི་ཡོན་ཏན་ལེགས་མཛོད་འདི་བརྗོད་དོ།
en: And described this excellent treasury of his qualities.

source: །འདི་འདྲའི་རྗེས་སུ་བསྟན་པ་དམ་པ་དང་། །གདམས་ངག་དེ་འདྲ་ནོར་བཟངས་ཐོས་གྱུར་ནས།
en: When Sudhana had heard such instructions And such a sublime teaching as this,

source: །དགའ་བའི་ཤུགས་ཀྱིས་དབང་པོ་མངོན་བརླན་པས།
en: His senses were saturated by the power of joy,

source: །མཆི་མའི་རྒྱུད་མང་རབ་ཏུ་དེས་ཀྱང་བླགས།
en: And he streamed with a flow of many tears.

source: །དགའ་བའི་ཉམས་ཆེན་ཉམས་སུ་མྱོང་བར་འགྱུར།
en: There arose a great experience of joy,

source: །དབང་པོ་ཚིམ་ནས་ཤུགས་ཀྱིས་དབུགས་ཀྱང་ཕྱུང་།
en: His senses were satisfied, and he was spontaneously relieved.

source: །ནོར་བཟངས་ལངས་ཏེ་ཐལ་མོ་རབ་སྦྱར་ནས། །བྱམས་པ་དེ་ལ་བསྐོར་བ་རབ་ཏུ་བྱས།
en: Sudhana stood up with his palms pressed together, And he performed circumambulations around Maitreya.

source: །དེ་ཡི་ལག་ཏུ་འཇམ་དཔལ་སེམས་དབང་གིས།
en: Through the power of Mañjuśrī there appeared

source: །མེ་ཏོག་ཕྲེང་བ་རིན་ཆེན་མཛེས་པ་དག །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་པས་མངོན་འཐོན་པ།
en: A precious garland of flowers in Sudhana’s hands,

source: །ཡིད་དུ་འོང་བ་མང་པོ་བྱུང་བར་གྱུར།
en: And there appeared many kinds of delights, Which were arising from bodhisattva prayers.

source: །ནོར་བཟངས་དེ་ཚེ་རབ་ཏུ་དགའ་གྱུར་ནས།
en: At that time, Sudhana was filled with joy,

source: །དགའ་བར་དེ་དག་བྱམས་པ་དེ་ལ་གཏོར།
en: And he joyfully scattered them toward Maitreya.

source: །དེ་ཚེ་དེ་ཡི་མགོ་ལ་ཀུན་ནས་བྱུགས།
en: At that time, Maitreya stroked his head,

source: །བྱམས་པས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས།
en: And then he recited this verse:

source: །རྒྱལ་བའི་སྲས་པོ་ནོར་བཟངས་ལེགས་སོ་ལེགས།
en: “Well done, well done, Jinaputra Sudhana.

source: །དེ་ལྟར་ཁྱོད་ནི་ཡོངས་སུ་མི་སྐྱོ་བས། །ང་དང་འཇམ་དཔལ་ཅི་འདྲ་ཅི་བཞིན་དུ།
en: In that manner you remain unwearied.

source: །ཡོན་ཏན་སྣོད་དུ་ཁྱོད་ནི་མྱུར་དེ་འགྱུར།
en: You will quickly become a vessel for qualities So that you will be just like me and Mañjuśrī.”

source: །ཐོས་ནས་ནོར་བཟངས་དགའ་བའི་ཚིག་བརྗོད་པ།
en: When he heard that, Sudhana, filled with joy, recited,

source: །འདི་འདྲའི་དགེ་བཤེས་བདག་དང་ཕྲད་པ་ནི།
en: “My meeting this kind of kalyāṇamitra

source: །སྲིད་པ་བརྒྱ་ཕྲག་འགྲངས་པར་ཤིན་ཏུ་དཀོན།
en: Would be a rare event even in hundreds of lives!

source: །བདག་གིས་དེ་རིང་འདིར་ཕྱིན་ཤིན་ཏུ་ལེགས། །ཡོན་ཏན་ཀུན་གྱི་ཕ་རོལ་ཕྱིན་གྱུར་པ།
en: It is excellent that I have come here today!

source: །འཇམ་དཔལ་ཁྱོད་ཀྱི་བྱིན་རླབས་བཟང་པོ་ཡིས།
en: “Through your excellent blessing, Mañjuśrī, You who have attained the perfection of all qualities,

source: །བདག་གིས་བཤེས་གཉེན་འདི་དག་དཀོན་པ་རྙེད།
en: I have found these rare kalyāṇamitras.

source: །ཁྱོད་དང་བདག་ཏུ་མྱུར་དུ་འགྲོགས་པར་རོ།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་བཅུ་དགུ་པ།
en: May I soon be together with you!”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Then Sudhana, the head merchant’s son, stood before the bodhisattva mahāsattva Maitreya with his palms together in homage and said, “Ārya, I have set out upon the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་བྱམས་པ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་སྟེ།
en: “Ārya Maitreya, you have been prophesied by all the tathāgatas to be only one lifetime from the highest, complete enlightenment.

source: གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འགོད་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ལགས།
en: “Those who are only one lifetime from the highest, complete enlightenment have transcended all the established states of bodhisattvas.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་རབ་ཏུ་ཞུགས་པ་ལགས།
en: They have entered the faultlessness of bodhisattvas.

source: དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ལགས།
en: They have completed all the perfections.

source: དེ་ནི་བཟོད་པའི་སྒོ་ཐམས་ཅད་དུ་ཞུགས་པ་ལགས།
en: They have entered all the gateways to patience.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་རབ་ཏུ་བརྙེས་པ་ལགས།
en: They have attained all the bodhisattva bhūmis.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་སྒོ་ཐམས་ཅད་ལ་རྣམ་པར་རོལ་པ་ལགས།
en: They delight in all the entrances to the bodhisattva liberations.

source: དེས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབས་པ་ལགས།
en: They have accomplished all samādhis.

source: །དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྒྱུད་ཐམས་ཅད་རྟོགས་པར་ཐུགས་སུ་ཆུད་པ་ལགས།
en: They have realized all the states of existence of bodhisattvas.

source: དེས་ནི་གཟུངས་དང་སྤོབས་པ་སྣང་བའི་ཚུལ་ཐམས་ཅད་ལ་རབ་ཏུ་བརྙེས་པ་ལགས།
en: They have attained all the ways of the light of retention and eloquence.

source: །དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ལ་མངའ་ཐོབ་པ་ལགས།
en: They have gained all the powers of bodhisattvas.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཤིན་ཏུ་བསྩགས་པ་ལགས།
en: They have gathered all the accumulations of bodhisattvas.

source: དེས་ནི་ཤེས་རབ་དང་ཐབས་མཁས་པའི་ཚུལ་ལ་རྣམ་པར་རོལ་པ་ལགས།
en: They delight in the ways of skill in wisdom and methods.

source: དེས་ནི་མངོན་པར་ཤེས་པ་ཆེན་པོ་དང་། རིག་པ་དང་ཡེ་ཤེས་སྣང་བའི་ཚུལ་བསྐྱེད་པ་ལགས།
en: They have developed the ways of the light of great higher cognition, knowledge, and wisdom.

source: དེ་ནི་བསླབ་པ་ཐམས་ཅད་ལས་བྱུང་བ་ལགས།
en: They have come forth from all trainings.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་སྦྱངས་པ་ལགས།
en: They have purified all bodhisattva conduct.

source: དེས་ནི་སྨོན་ལམ་གྱིས་འབྱུང་བའི་སྒོ་ཐམས་ཅད་མངོན་པར་བསྒྲུབས་པ་ལགས།
en: They have accomplished all the gateways that arise from prayer.

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ལུང་བསྟན་པ་རབ་ཏུ་བླངས་པ་ལགས།
en: They have obtained the prophecies of all tathāgatas.

source: དེ་ནི་ཐེག་པ་ཐམས་ཅད་ཀྱིས་འབྱུང་བའི་སྒོ་ལ་མཁས་པ་ལགས།
en: They are skilled in the gateways that arise from all yānas.

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཡང་དག་པར་བླངས་པ་ལགས།
en: They have obtained the blessing of all the tathāgatas.

source: དེས་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་བཟུང་བ་ལགས།
en: They have grasped the enlightenment of all the buddhas.

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་མཛོད་བཟུང་བ་ལགས།
en: They have gained the Dharma treasure of all the tathāgatas.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་མཛོད་འཛིན་པ་ལགས།
en: They possess the treasure of the secrets of all the tathāgatas.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱི་སྤྱི་བོར་ཕྱིན་པ་ལགས།
en: They are the heads of all the secret fields of all bodhisattvas.
